GHB2/src/Catalogs/гхб_Помещения/гхб_Помещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гхб_Помещения</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>УИДСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

GHB2/src/InformationRegisters/гхб_ДополнительныеСвойстваПомещений/гхб_ДополнительныеСвойстваПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ДополнительныеСвойстваПомещений</name>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныеЗаКонсервациюПомещения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныеЗаПожарнуюБезопасность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_ОтветственныеЗаПомещения/гхб_ОтветственныеЗаПомещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ОтветственныеЗаПомещения</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ОтветственныйЗаПомещение</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_РаспределениеДоступовВПомещения/гхб_РаспределениеДоступовВПомещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_РаспределениеДоступовВПомещения</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ЮридическоеЛицоСобственник</name>
    <type>
      <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеЛицоРаспорядитель</name>
    <type>
      <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ДивизионРаспорядитель</name>
    <type>
      <types>CatalogRef.гхб_Дивизионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДепартаментРаспорядитель</name>
    <type>
      <types>CatalogRef.гхб_ПодразделенияОрганизацийБазХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическиеЛицаВПомещении</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДивизионыВПомещении</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДепартаментыВПомещении</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/Documents/гхб_СвойстваПомещений/гхб_СвойстваПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гхб_СвойстваПомещений</name>
  <registerRecords>InformationRegister.гхб_РуководителиЛокаций</registerRecords>
  <registerRecords>InformationRegister.гхб_СвойстваПомещений</registerRecords>
  <registerRecords>InformationRegister.гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМест</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.гхб_ВидыОперацийСвойстваПомещений</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Локации</name>
    <attributes>
      <name>Локация</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеНовое</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Руководитель</name>
      <type>
        <types>CatalogRef.гхб_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>РуководительНовый</name>
      <type>
        <types>CatalogRef.гхб_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Закрыть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗакрытьНовое</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УИДСинхронизации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьДляЗакрепленияПарковочныхМест</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьДляЗакрепленияПарковочныхМестНовое</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Корпуса</name>
    <attributes>
      <name>Корпус</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Локация</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛокацияНовая</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеНовое</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Закрыть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗакрытьНовое</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УИДСинхронизации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлементыСтроений</name>
    <attributes>
      <name>ЭлементСтроения</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Локация</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛокацияНовая</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Корпус</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>КорпусНовый</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеНовое</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Закрыть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗакрытьНовое</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УИДСинхронизации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Помещения</name>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Локация</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛокацияНовая</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Корпус</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>КорпусНовый</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭлементСтроения</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭлементСтроенияНовый</name>
      <type>
        <types>CatalogRef.гхб_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеНовое</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПомещения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПомещенияНовый</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДробнаяЧасть</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДробнаяЧастьНовая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Площадь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПлощадьНовая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПомещения</name>
      <type>
        <types>CatalogRef.гхб_ТипыПомещений</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипПомещенияНовый</name>
      <type>
        <types>CatalogRef.гхб_ТипыПомещений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановоеКоличествоРабочихМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПлановоеКоличествоРабочихМестНовое</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НетРабочихМест</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НетРабочихМестНовое</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УточняющаяИнформация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УточняющаяИнформацияНовая</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерНаГенеральномПлане</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерНаГенеральномПланеНовый</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Закрыть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗакрытьНовое</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УИДСинхронизации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоступВПомещениеПоКлючу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступВПомещениеПоКлючуНовый</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НаличиеОхраннойСигнализации</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НаличиеОхраннойСигнализацииНовое</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнутреннийНомерКТ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВнутреннийНомерКТНовый</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаличиеКТ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НаличиеКТНовое</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СогласованиеДоступаСВысшимРуководителем</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СогласованиеДоступаСВысшимРуководителемНовое</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщегоПользования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщегоПользованияНовый</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

GHB2/src/Catalogs/гхб_Помещения/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.УИДСинхронизации.Видимость = РольДоступна(Метаданные.Роли.ПолныеПрава);
	
	ЗаполнитьСвойстваПомещения();
	ЮридическиеЛицаВПомещениях.Параметры.УстановитьЗначениеПараметра("Помещение", Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваПомещения()
	
	_СвойстваПомещения = Справочники.гхб_Помещения.ВернутьДанныеПомещения(Объект.Ссылка, Ложь);
	
	Локация = _СвойстваПомещения.Локация;
	Корпус = _СвойстваПомещения.Корпус;
	ЭлементСтроения = _СвойстваПомещения.ЭлементСтроения;
	Закрыть = _СвойстваПомещения.Закрыть;
	ТипПомещения = _СвойстваПомещения.ТипПомещения;
	НомерПомещения = _СвойстваПомещения.НомерПомещения;
	ДробнаяЧасть = _СвойстваПомещения.ДробнаяЧасть;
	ТипПомещения = _СвойстваПомещения.ТипПомещения;
	Площадь = _СвойстваПомещения.Площадь;
	НомерНаГенеральномПлане = _СвойстваПомещения.НомерНаГенеральномПлане;
	ПлановоеКоличествоРабочихМест = _СвойстваПомещения.ПлановоеКоличествоРабочихМест;
	НетРабочихМест = _СвойстваПомещения.НетРабочихМест;
	УточняющаяИнформация = _СвойстваПомещения.УточняющаяИнформация;
	ДоступВПомещениеПоКлючу = _СвойстваПомещения.ДоступВПомещениеПоКлючу;
	НаличиеОхраннойСигнализации = _СвойстваПомещения.НаличиеОхраннойСигнализации;
	ВнутреннийНомерКТ = _СвойстваПомещения.ВнутреннийНомерКТ;
	НаличиеКТ = _СвойстваПомещения.НаличиеКТ;
	СогласованиеДоступаСВысшимРуководителем = _СвойстваПомещения.СогласованиеДоступаСВысшимРуководителем;
	ОбщегоПользования = _СвойстваПомещения.ОбщегоПользования;
	
	ДополнительнаяИнформация = РегистрыСведений.гхб_ДополнительныеСвойстваПомещений.ВернутьДополнительнуюИнформациюДляПомещения(Объект.Ссылка);
	
	ОтветственныйЗаПомещение = РегистрыСведений.гхб_ОтветственныеЗаПомещения.ВернутьОтветственногоДляПомещения(Объект.Ссылка);
	
	_Данные = РегистрыСведений.гхб_РаспределениеДоступовВПомещения.ВернутьДанныеПоПомещению(Объект.Ссылка);
	ЮридическоеЛицоСобственник = _Данные.ЮридическоеЛицоСобственник;
	ЮридическоеЛицоРаспорядитель = _Данные.ЮридическоеЛицоРаспорядитель;
	ДивизионРаспорядитель = _Данные.ДивизионРаспорядитель;
	ДепартаментРаспорядитель = _Данные.ДепартаментРаспорядитель;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьПомещение(Команда)
	
	_Параметры = Новый Структура();
	_Параметры.Вставить("Помещение", Объект.Ссылка);
	_Параметры.Вставить("ТипПомещения", ТипПомещения);
	
	_ОписаниеОповещения = Новый ОписаниеОповещения("РедактироватьПомещениеЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Документ.гхб_СвойстваПомещений.Форма.ФормаДокумента", _Параметры, ЭтотОбъект, , , , _ОписаниеОповещения, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьПомещениеЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	ЗаполнитьСвойстваПомещения();
	Элементы.ЮридическиеЛицаВПомещениях.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЮридическиеЛицаВПомещенияхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры
